public_html/papers/20240711-siarp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-23 Thu 13:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Method for detecting anomalies in the well and oil reservoir system using artificial intelligence</title>
<meta name="author" content="Priscila Magalhaes Ribeiro, Fernando Nascimento Coelho, Luiz José Schirmer Da Silva, *Guilherme Gonçalves Schardong*, Jonatas Dos Santos Grosman, Vinícius Da Silva, André Ricardo Ducca Fernandes, Leonardo Osorio Pelisoli, Hélio Côrtes Vieira Lopes" />
<meta name="generator" content="Org Mode" />
<meta name="referrer" content="origin" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Method for detecting anomalies in the well and oil reservoir system using artificial intelligence</h1>


<div id="outline-container-org5e2b629" class="outline-2">
<h2 id="org5e2b629">Abstract</h2>
<div class="outline-text-2" id="text-org5e2b629">
<p>
The main objective of the present invention is to enable continuous monitoring and detect anomalous behavior in wells equipped with intelligent completion automatically by means of a method implemented with artificial intelligence. The present invention applies AI techniques to monitor wells in an oil field and has the ability to understand what the usual behavior of each well would be, based on temperature, pressure and flow rate sensors, and then identify by means of a stochastic technique of selection of outliers which a deviation from usual behavior would be. From the outlier detection, it is possible to quantify an anomaly probability and associate the same with a possible event, such as: sensor failure and loss of data, closure of one of the producing intervals, scale deposition, among others.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Priscila Magalhaes Ribeiro, Fernando Nascimento Coelho, Luiz José Schirmer Da Silva, <b>Guilherme Gonçalves Schardong</b>, Jonatas Dos Santos Grosman, Vinícius Da Silva, André Ricardo Ducca Fernandes, Leonardo Osorio Pelisoli, Hélio Côrtes Vieira Lopes</p>
<p class="date">Created: 2025-10-23 Thu 13:47</p>
</div>
</body>
</html>
